src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUsersRequest>
            <gs:username>Bret</gs:username>
        </gs:getUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>