request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getUserRequest>
         <gs:name>kiquetal</gs:name>
      </gs:getUserRequest>
   </soapenv:Body>
</soapenv:Envelope>
